{"class_name": "Model", "config": {"output_layers": [["mixed1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 160, 320, 3], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_1", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_1", "trainable": true}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_2", "trainable": true}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "name": "convolution2d_3", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_3", "trainable": true}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 80, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_4", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_4", "trainable": true}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 192, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_5", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_5", "trainable": true}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"name": "convolution2d_9", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_9", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_9", "trainable": true}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_7", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_10", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 96, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "name": "convolution2d_10", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_7", "trainable": true}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_10", "trainable": true}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "averagepooling2d_1", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "border_mode": "same", "strides": [1, 1], "name": "averagepooling2d_1", "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_6", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 5, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 5, "b_constraint": null, "border_mode": "same", "name": "convolution2d_8", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"name": "convolution2d_11", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 96, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "name": "convolution2d_11", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"name": "convolution2d_12", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_12", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_6", "trainable": true}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_8", "trainable": true}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_11", "trainable": true}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_12", "trainable": true}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"name": "mixed0", "class_name": "Merge", "config": {"output_mask_type": "raw", "mode": "concat", "dot_axes": -1, "concat_axis": 3, "output_mask": null, "arguments": {}, "mode_type": "raw", "name": "mixed0", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]]}, {"name": "convolution2d_16", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_16", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "batchnormalization_16", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_16", "trainable": true}, "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"name": "convolution2d_14", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_14", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "convolution2d_17", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 96, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "name": "convolution2d_17", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_14", "trainable": true}, "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"name": "batchnormalization_17", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_17", "trainable": true}, "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"name": "averagepooling2d_2", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "border_mode": "same", "strides": [1, 1], "name": "averagepooling2d_2", "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "convolution2d_13", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_13", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "convolution2d_15", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 5, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 5, "b_constraint": null, "border_mode": "same", "name": "convolution2d_15", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"name": "convolution2d_18", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 3, "W_constraint": null, "nb_filter": 96, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "name": "convolution2d_18", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"name": "convolution2d_19", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_row": 1, "W_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "name": "convolution2d_19", "dim_ordering": "tf", "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["averagepooling2d_2", 0, 0]]]}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_13", "trainable": true}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_15", "trainable": true}, "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"name": "batchnormalization_18", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_18", "trainable": true}, "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"name": "batchnormalization_19", "class_name": "BatchNormalization", "config": {"axis": 3, "mode": 0, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_19", "trainable": true}, "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"name": "mixed1", "class_name": "Merge", "config": {"output_mask_type": "raw", "mode": "concat", "dot_axes": -1, "concat_axis": 3, "output_mask": null, "arguments": {}, "mode_type": "raw", "name": "mixed1", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]]}], "name": "model_2", "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.1.2"}