{"config": {"layers": [{"config": {"name": "input_1", "batch_input_shape": [null, 160, 320, 3], "sparse": false, "input_dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_3", "nb_filter": 32, "activation": "relu", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2]}, "name": "convolution2d_3", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"epsilon": 1e-05, "gamma_regularizer": null, "axis": 3, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_1", "mode": 0, "trainable": true}, "name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "BatchNormalization"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_4", "nb_filter": 32, "activation": "relu", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_4", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"epsilon": 1e-05, "gamma_regularizer": null, "axis": 3, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_2", "mode": 0, "trainable": true}, "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "BatchNormalization"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "name": "convolution2d_5", "nb_filter": 64, "activation": "relu", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_5", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"epsilon": 1e-05, "gamma_regularizer": null, "axis": 3, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_3", "mode": 0, "trainable": true}, "name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "BatchNormalization"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [3, 3], "trainable": true}, "name": "maxpooling2d_1", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_6", "nb_filter": 80, "activation": "relu", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "nb_row": 1, "init": "glorot_uniform", "nb_col": 1, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_6", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"epsilon": 1e-05, "gamma_regularizer": null, "axis": 3, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_4", "mode": 0, "trainable": true}, "name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "BatchNormalization"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_7", "nb_filter": 192, "activation": "relu", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1]}, "name": "convolution2d_7", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"epsilon": 1e-05, "gamma_regularizer": null, "axis": 3, "momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_5", "mode": 0, "trainable": true}, "name": "batchnormalization_5", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "BatchNormalization"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [3, 3], "trainable": true}, "name": "maxpooling2d_2", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "class_name": "MaxPooling2D"}], "name": "model_2", "output_layers": [["maxpooling2d_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.1.2", "class_name": "Model"}