{"config": {"output_layers": [["mixed0", 0, 0]], "layers": [{"config": {"input_dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 160, 320, 3]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "nb_filter": 32, "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "name": "convolution2d_1"}, "class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_1", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "nb_filter": 32, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_2"}, "class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_2", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_3"}, "class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_3", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"trainable": true, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_1", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "nb_col": 1, "nb_filter": 80, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_4"}, "class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_4", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "nb_filter": 192, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_5"}, "class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_5", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"trainable": true, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_2", "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 1, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_9"}, "class_name": "Convolution2D", "name": "convolution2d_9", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_9", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_9", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 1, "nb_filter": 48, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_7"}, "class_name": "Convolution2D", "name": "convolution2d_7", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 3, "nb_filter": 96, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_10"}, "class_name": "Convolution2D", "name": "convolution2d_10", "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_7", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_7", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_10", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_10", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"config": {"trainable": true, "pool_size": [3, 3], "dim_ordering": "tf", "border_mode": "same", "strides": [1, 1], "name": "averagepooling2d_1"}, "class_name": "AveragePooling2D", "name": "averagepooling2d_1", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 1, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_6"}, "class_name": "Convolution2D", "name": "convolution2d_6", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 5, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 5, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_8"}, "class_name": "Convolution2D", "name": "convolution2d_8", "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 3, "nb_filter": 96, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_11"}, "class_name": "Convolution2D", "name": "convolution2d_11", "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"config": {"trainable": true, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 1, "nb_filter": 32, "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_12"}, "class_name": "Convolution2D", "name": "convolution2d_12", "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_6", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_6", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_8", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_8", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_11", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_11", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"config": {"trainable": true, "axis": 3, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_12", "epsilon": 1e-05}, "class_name": "BatchNormalization", "name": "batchnormalization_12", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"config": {"output_mask_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape_type": "raw", "arguments": {}, "mode_type": "raw", "concat_axis": 3, "output_shape": null, "name": "mixed0", "output_mask": null}, "class_name": "Merge", "name": "mixed0", "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_2"}, "keras_version": "1.1.2", "class_name": "Model"}