{"config": [{"config": {"nb_filter": 64, "dim_ordering": "tf", "nb_row": 1, "W_regularizer": null, "batch_input_shape": [null, 17, 37, 256], "W_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "b_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "nb_col": 1, "bias": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "small_normal", "output_dim": 32, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "b_regularizer": null, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "bias": true, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"init": "small_normal", "output_dim": 1, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "b_regularizer": null, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "bias": true, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}