{"config": [{"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_101", "input_dtype": "float32", "activation": "linear", "batch_input_shape": [null, 17, 37, 192], "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "nb_row": 1, "init": "glorot_uniform", "nb_col": 1, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 8}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_7", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 128, "name": "dense_13", "activation": "tanh", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "small_normal", "W_regularizer": {"name": "WeightRegularizer", "l2": 0.009999999776482582, "l1": 0.0}, "input_dim": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "name": "dense_14", "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "small_normal", "W_regularizer": {"name": "WeightRegularizer", "l2": 0.009999999776482582, "l1": 0.0}, "input_dim": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}