{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "input_dtype": "float32", "subsample": [1, 1], "b_constraint": null, "activation": "linear", "batch_input_shape": [null, 17, 37, 192], "nb_row": 1, "nb_filter": 16, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_col": 1, "name": "convolution2d_6", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "b_constraint": null, "activation": "tanh", "init": "small_normal", "activity_regularizer": null, "bias": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "name": "dense_11", "W_constraint": null, "b_regularizer": null, "output_dim": 32}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "b_constraint": null, "activation": "linear", "init": "small_normal", "activity_regularizer": null, "bias": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "name": "dense_12", "W_constraint": null, "b_regularizer": null, "output_dim": 1}}]}