{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "nb_filter": 8, "activity_regularizer": null, "nb_row": 1, "W_constraint": null, "batch_input_shape": [null, 17, 37, 192], "b_constraint": null, "bias": true, "subsample": [1, 1], "nb_col": 1, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "name": "convolution2d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "activity_regularizer": null, "output_dim": 128, "input_dim": null, "b_regularizer": null, "init": "small_normal", "b_constraint": null, "bias": true, "activation": "tanh", "W_constraint": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "activity_regularizer": null, "output_dim": 1, "input_dim": null, "b_regularizer": null, "init": "small_normal", "b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_2"}}]}